### Forest Mainnet Infrastructure  Plan: success

<details><summary>Show Plan</summary>

```
module.mainnet.data.digitalocean_project.forest_project: Reading...
module.mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=5137f810-dcfc-11ed-bcda-0a58ac14d195]
module.mainnet.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/12886492327922169494]
module.mainnet.digitalocean_droplet.forest: Refreshing state... [id=351088974]
module.mainnet.digitalocean_droplet.forest_observability: Refreshing state... [id=351088975]
module.mainnet.local_file.inventory: Refreshing state... [id=eb285a5011bcf88da2d202db4a03e3cf1732206c]
module.mainnet.digitalocean_firewall.forest_observability_firewall: Refreshing state... [id=6909ecfb-47b7-41a0-97da-382ca52a189c]
module.mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=bae71eb2-757b-4dfc-ac4e-4db0b6e75120]
module.mainnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=351088974-5137f810-dcfc-11ed-bcda-0a58ac14d195-20230417084631402100000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.mainnet.digitalocean_droplet.forest must be replaced
+/- resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-04-17T08:41:51Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "351088974" -> (known after apply)
      ~ ipv4_address         = "64.226.107.21" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.7" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-mainnet-iac"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          + "fa:48:60:7b:b0:c4:86:70:e9:fa:e9:f8:fb:c7:2e:72",
            # (22 unchanged elements hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:351088974" -> (known after apply)
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [
          - "5137f810-dcfc-11ed-bcda-0a58ac14d195",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.mainnet.digitalocean_droplet.forest_observability must be replaced
+/- resource "digitalocean_droplet" "forest_observability" {
      ~ created_at           = "2023-04-17T08:41:51Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "351088975" -> (known after apply)
      ~ ipv4_address         = "64.226.118.187" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.9" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-mainnet-observability"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          + "fa:48:60:7b:b0:c4:86:70:e9:fa:e9:f8:fb:c7:2e:72",
            # (22 unchanged elements hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:351088975" -> (known after apply)
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 351088974,
        ] -> (known after apply)
        id              = "bae71eb2-757b-4dfc-ac4e-4db0b6e75120"
        name            = "forest-mainnet-iac"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "6116" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [] -> null
          - source_droplet_ids        = [
              - 351088975,
            ] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      - inbound_rule {
          - port_range                = "9100" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [] -> null
          - source_droplet_ids        = [
              - 351088975,
            ] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      + inbound_rule {
          + port_range                = "6116"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = (known after apply)
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "9100"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = (known after apply)
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

        # (5 unchanged blocks hidden)
    }

  # module.mainnet.digitalocean_firewall.forest_observability_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_observability_firewall" {
      ~ droplet_ids     = [
          - 351088975,
        ] -> (known after apply)
        id              = "6909ecfb-47b7-41a0-97da-382ca52a189c"
        name            = "forest-mainnet-observability"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "3100" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [] -> null
          - source_droplet_ids        = [
              - 351088974,
            ] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      + inbound_rule {
          + port_range                = "3100"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = (known after apply)
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

        # (6 unchanged blocks hidden)
    }

  # module.mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:351088974",
          - "do:droplet:351088975",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 351088974 # forces replacement -> (known after apply)
      ~ id         = "351088974-5137f810-dcfc-11ed-bcda-0a58ac14d195-20230417084631402100000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.mainnet.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/hosts_mainnet"
      + id                   = (known after apply)
    }

Plan: 4 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>